Revit 2027 API
DrawLayer Enumeration
 An enumerated type containing possible DrawLayer options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DrawLayer
Public Enumeration DrawLayer
public enum class DrawLayer
type DrawLayer
Members
Member name | Value | Description
Background | 1 |  Draw in the background layer
Foreground | 0 |  Draw in the foreground layer
See Also
Reference
Autodesk.Revit.DB Namespace